RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/include/cy_crypto_core_hw_vu.h
/***************************************************************************//**
* \file cy_crypto_core_hw_vu.h
* \version 2.50
*
* \brief
*  This file provides constants and function prototypes
*  for the Vector Unit functions in the Crypto block driver.
*
********************************************************************************
* \copyright
* Copyright (c) (2020-2022), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*    http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/


#if !defined (CY_CRYPTO_CORE_HW_VU_H)
#define CY_CRYPTO_CORE_HW_VU_H

#include "cy_crypto_core_hw.h"

#if defined (CY_IP_MXCRYPTO)

#if defined(__cplusplus)
extern "C" {
#endif

#if (CPUSS_CRYPTO_VU == 1)

/***************************************
*        Crypto IP opcodes
***************************************/

#define CY_CRYPTO_VU_HW_REG0            (0u)
#define CY_CRYPTO_VU_HW_REG1            (1u)
#define CY_CRYPTO_VU_HW_REG2            (2u)
#define CY_CRYPTO_VU_HW_REG3            (3u)
#define CY_CRYPTO_VU_HW_REG4            (4u)
#define CY_CRYPTO_VU_HW_REG5            (5u)
#define CY_CRYPTO_VU_HW_REG6            (6u)
#define CY_CRYPTO_VU_HW_REG7            (7u)
#define CY_CRYPTO_VU_HW_REG8            (8u)
#define CY_CRYPTO_VU_HW_REG9            (9u)
#define CY_CRYPTO_VU_HW_REG10           (10u)
#define CY_CRYPTO_VU_HW_REG11           (11u)
#define CY_CRYPTO_VU_HW_REG12           (12u)
#define CY_CRYPTO_VU_HW_REG13           (13u)
#define CY_CRYPTO_VU_HW_REG14           (14u)
#define CY_CRYPTO_VU_HW_REG15           (15u)

/* Crypto IP condition codes (vector unit) */
#define CY_CRYPTO_VU_COND_ALWAYS        (0x00u)
#define CY_CRYPTO_VU_COND_EQ            (0x01u)
#define CY_CRYPTO_VU_COND_NE            (0x02u)
#define CY_CRYPTO_VU_COND_CS            (0x03u)
#define CY_CRYPTO_VU_COND_CC            (0x04u)
#define CY_CRYPTO_VU_COND_HI            (0x05u)
#define CY_CRYPTO_VU_COND_LS            (0x06u)
#define CY_CRYPTO_VU_COND_EVEN          (0x07u)
#define CY_CRYPTO_VU_COND_ODD           (0x08u)
#define CY_CRYPTO_VU_COND_MASK          (0x1FFu)

/* Crypto IP status (vector unit) */
#define CY_CRYPTO_VU_STATUS_CARRY       (0u)
#define CY_CRYPTO_VU_STATUS_EVEN        (1u)
#define CY_CRYPTO_VU_STATUS_ZERO        (2u)
#define CY_CRYPTO_VU_STATUS_ONE         (3u)
#define CY_CRYPTO_VU_STATUS_CARRY_BIT   (uint32_t)(((uint32_t)1u) << CY_CRYPTO_VU_STATUS_CARRY)
#define CY_CRYPTO_VU_STATUS_EVEN_BIT    (uint32_t)(((uint32_t)1u) << CY_CRYPTO_VU_STATUS_EVEN)
#define CY_CRYPTO_VU_STATUS_ZERO_BIT    (uint32_t)(((uint32_t)1u) << CY_CRYPTO_VU_STATUS_ZERO)
#define CY_CRYPTO_VU_STATUS_ONE_BIT     (uint32_t)(((uint32_t)1u) << CY_CRYPTO_VU_STATUS_ONE)
#define CY_CRYPTO_VU_STATUS_MASK        (uint32_t)(CY_CRYPTO_VU_STATUS_CARRY_BIT | CY_CRYPTO_VU_STATUS_EVEN_BIT \
                                                   CY_CRYPTO_VU_STATUS_ZERO_BIT | CY_CRYPTO_VU_STATUS_ONE_BIT)

#define CY_CRYPTO_VU_REG_BIT(nreg)      (((uint32_t)1u) << (nreg))

/* Crypto registers field processing (vector unit) */
#define CY_CRYPTO_VU_GET_REG_DATA(data)       (((data) >> 16U) & 0x00003fffUL)
#define CY_CRYPTO_VU_GET_REG_SIZE(data)       ((data) & 0x00000fffUL)

#define CY_CRYPTO_VU_SIZE_FLD_MASK            (0x00001fffuL)
#define CY_CRYPTO_VU_DATA_FLD_MASK            (0x00003fffuL)
#define CY_CRYPTO_VU_DATA_FLD_POS             (16u)

/* Vector Unit instructions */
#define CY_CRYPTO_VU_ALLOC_MEM_OPC            (0x12u)
#define CY_CRYPTO_VU_FREE_MEM_OPC             (0x13u)

/* Instructions with register operand only, category I */
#define CY_CRYPTO_VU_SET_REG_OPC              (0x80u)

#define CY_CRYPTO_VU_LD_REG_OPC               (0x00u)
#define CY_CRYPTO_VU_ST_REG_OPC               (0x01u)
#define CY_CRYPTO_VU_MOV_REG_OPC              (0x02u)

/* Instructions with register operand only, category III */
#define CY_CRYPTO_VU_SWAP_REG_OPC             (0x03u)

/* Instructions with register operand only, category IV */
#define CY_CRYPTO_VU_MOV_REG_TO_STATUS_OPC    (0x04u)

/* Instructions with register operand only, category V */
#define CY_CRYPTO_VU_MOV_STATUS_TO_REG_OPC    (0x05u)

#define CY_CRYPTO_VU2_MOV_IMM_TO_STATUS_OPC   (0x0Fu)

/* Instructions with register operand only, category VI */
#define CY_CRYPTO_VU_PUSH_REG_OPC             (0x10u)
#define CY_CRYPTO_VU_POP_REG_OPC              (0x11u)

/* Instructions with register operand only, category VII */
#define CY_CRYPTO_VU_ADD_REG_OPC              (0x06u)
#define CY_CRYPTO_VU_SUB_REG_OPC              (0x07u)
#define CY_CRYPTO_VU_OR_REG_OPC               (0x08u)
#define CY_CRYPTO_VU_AND_REG_OPC              (0x09u)
#define CY_CRYPTO_VU_XOR_REG_OPC              (0x0Au)
#define CY_CRYPTO_VU_NOR_REG_OPC              (0x0Bu)
#define CY_CRYPTO_VU_NAND_REG_OPC             (0x0Cu)
#define CY_CRYPTO_VU_MIN_REG_OPC              (0x0Du)
#define CY_CRYPTO_VU_MAX_REG_OPC              (0x0Eu)

/* Instructions with mixed operands, category I */
#define CY_CRYPTO_VU_LSL_OPC                  (0x20u)
#define CY_CRYPTO_VU1_LSR_OPC                 (0x24u)
#define CY_CRYPTO_VU2_LSR_OPC                 (0x23u)

/* Instructions with mixed operands, category II */
#define CY_CRYPTO_VU_LSL1_OPC                 (0x21u)
#define CY_CRYPTO_VU_LSL1_WITH_CARRY_OPC      (0x22u)

#define CY_CRYPTO_VU1_LSR1_OPC                (0x25u)
#define CY_CRYPTO_VU1_LSR1_WITH_CARRY_OPC     (0x26u)
#define CY_CRYPTO_VU2_LSR1_OPC                (0x24u)
#define CY_CRYPTO_VU2_LSR1_WITH_CARRY_OPC     (0x25u)

/* Instructions with mixed operands, category III */
#define CY_CRYPTO_VU1_SET_BIT_OPC             (0x2Cu)
#define CY_CRYPTO_VU1_CLR_BIT_OPC             (0x2Du)
#define CY_CRYPTO_VU1_INV_BIT_OPC             (0x2Eu)

#define CY_CRYPTO_VU2_SET_BIT_OPC             (0x28u)
#define CY_CRYPTO_VU2_CLR_BIT_OPC             (0x29u)
#define CY_CRYPTO_VU2_INV_BIT_OPC             (0x2Au)

/* Instructions with mixed operands, category IV */
#define CY_CRYPTO_VU1_GET_BIT_OPC             (0x2Fu)
#define CY_CRYPTO_VU2_GET_BIT_OPC             (0x2Bu)

/* Instructions with mixed operands, category V */
#define CY_CRYPTO_VU1_CLSAME_OPC              (0x28u)
#define CY_CRYPTO_VU1_CTSAME_OPC              (0x29u)

#define CY_CRYPTO_VU2_CLSAME_OPC              (0x26u)
#define CY_CRYPTO_VU2_CTSAME_OPC              (0x27u)

/* Instructions with memory buffer operands, category I */
#define CY_CRYPTO_VU_SET_TO_ZERO_OPC          (0x34u)
#define CY_CRYPTO_VU_SET_TO_ONE_OPC           (0x35u)

